Repository: ejfhp/bitonpaper
Catalog: flutter/lib/l10n/app_*.arb
Languages: it

source: yes
it: si

# intro_a
source: let you build paper wallets for
it: permette di generare portafogli di carta per

# intro_b
source: Keys, adresses, QR-Codes, everything is generated locally, nothing is sent over the Internet, your keys are safe, they never leave your device... just take care no one is watching your screen!
it: Le chiavi, gli indirizzi, i codici QR, tutto viene generato localmente, nulla viaggia su Internet, le tue chiavi sono al sicuro, non lasciano mai il tuo dispositivo... solo presta attenzione che nessuno stia guardando il tuo schermo!

# intro_f
source: Be aware that
it: Presta attenzione che

# intro_g
source: is a free application and comes
it: è un'applicazione gratuita e viene distrtibuita

# intro_h
source: whitout
it: senza

# intro_i
source: any kind of
it: alcun tipo

# intro_j
source: guarantee
it: di garanzia

# intro_k
source: . It could have malfunctions. Paper wallets can be lost or become unreadable.
it: . Potrebbe non funzionare bene. I portafogli di carta possono andare persi o possono diventare illeggibili.

# intro_l
source: Use it at your own risk.
it: Utilizzali a tuo rischio e pericolo.

# intro_p
source: We think that the original Bitcoin white paper, together with the genesis block, is what really defines Bitcoin.
it: Noi pensiamo che l'originale whitepaper di Bitcoin , assieme con il primo blocco, sia ciò che definisce Bitcoin.

# intro_q
source: We host the bitcoin.pdf here to underline the fact that the only Blockchain that fully respects Satoshi's work and that should be called "Bitcoin" is BitcoinSV (BSV):
it: Ospitiamo il file bitcoin.pdf in questa app per sottolinerae il fatto che l'unica Blockchain che pienamente rispetta il lavoro di Satoshi e che dovrebbe essere chiamata "Bitcoin" è BitcoinSV (BSV):

# intro_r
source: This application uses Google Analytics. No information is shared with any other third party service.
it: Questa applicazione utilizza Google Analytics. Nessuna informazione viene condivisa con altre entità terze.

# intro_continue
source: Continue
it: Continua

# intro_initializing
source: Initializing...
it: In caricamento...

# navigation_list
source: Arts
it: Arti

# navigation_wallets
source: Wallets
it: Portafogli

# navigation_scan
source: Scan
it: Scansiona

# navigation_print
source: Print
it: Stampa

# menu_loadBop
source: Load Art from a .bop
it: Carica Arte da un .bop

# menu_loadPicture
source: Create Art from picture
it: Crea Arte da immagine

# menu_exportBop
source: Export Art to a .bop
it: Esporta Arte in un .bop

# menu_exportJson
source: Export wallet to JSON
it: Esporta portafogli in JSON

# menu_exportTxt
source: Export keys to TXT
it: Esporta chiavi in TXT

# menu_print
source: Print wallets
it: Stampa portafogli

# menu_exportPDF
source: Export wallets to PDF
it: Esporta portafogli in PDF

# screenWallets_privateKey
source: Key
it: Chiave

# screenWallets_privatekeyQr
source: Address QRCode
it: QRCode Chiave

# screenWallets_address
source: Address
it: Indirizzo

# screenWallets_addressQr
source: Address QRCode
it: QRCode Idirizzo

# screenWallets_add
source: Add a new Key
it: Aggiungi una Chiave

# screenWallets_delete
source: Delete
it: Cancella

# screenWallets_exporttxt
source: Export Keys to TXT
it: Esporta le Chiavi in TXT

# screenWallets_exportjson
source: Export Keys and Addresses to JSON
it: Esporta Chiavi e Indirizzi in JSON

# screenPrint_print
source: Print PaperWallet
it: Stampa i portafogli di carta

# screenPrint_export
source: Export PaperWallet to PDF
it: Esporta i portafogli di carta in PDF

# screenPrint_next
source: Next
it: Prossimo

# screenPrint_previous
source: Previous
it: Precedente

# screenPrint_address
source: Address
it: Indirizzo

# screenPrint_key
source: Key
it: Chiave

# screenPrint_check
source: Please check that everything is is correctly readable
it: Per favore controlla che tutto sia leggibile

# screenScan_message
source: Sweep your paper wallet to a Paymail or a Bitcoin (BSV) address (be careful it's a beta feature).
it: Sposta il contenuto del tuo portafoglio di carta a un indirizzo Paymail or a un indirizzo Bitcoin (BSV) address (fai attenzione, è una funzionalità in beta).

# screenScan_paymail
source: destination Paymail
it: Paymail di destinazione

# screenScan_address
source: destination address
it: Indirizzo di destinazione

# screenScan_key
source: paper wallet key
it: chiave del portafoglio di carta

# screenScan_scan
source: scan
it: scansiona

# screenScan_balance
source: balance
it: saldo

# screenScan_sweep
source: Sweep!
it: Trasferisci!

# screenScan_complete
source: Sweep completed, your transaction can be seen here
it: Trasferimento completo, puoi vedere la tua transazione qui

# screenScan_clean
source: Clean
it: Pulisci

# screenScan_sure
source: Are you sure?
it: Sei sicuro?

# screenScan_surelong
source: Are you sure to do the transaction?
it: Sei sicuro di voler fare la transazione?

# screenEditor_ad
source: Address
it: Indirizzo

# screenEditor_adQr
source: Address QRCode
it: QRCode Indirizzo

# screenEditor_pk
source: Key
it: Chiave

# screenEditor_pkQr
source: Key QRCode
it: QRCode Chiave

# screenEditor_load
source: Load
it: Carica

# screenEditor_save
source: Save
it: Salva

# screenEditor_export
source: Export
it: Esporta

# screenEditor_select
source: Select 'Create Art from picture' in the menu and selact a PNG or JPG image.
it: Seleziona 'Crea Arte da immagine' dal menu e selezione un file PNG o JPG.

# message_waitingpdf
source: Please be patient, unfortunately exporting a PDF takes a while...
it: Per favore sii paziente, sfortunatamente esportare un PDF è un'operazione lunga...

# message_waitingprint
source: Please be patient, unfortunately printing a PDF takes a while...
it: Per favore sii paziente, sfortunatamente stampare un PDF è un'operazione lunga...
